{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 10, 256, 256, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "PredNet", "config": {"A_filt_sizes": [3, 3, 3], "LSTM_inner_activation": "hard_sigmoid", "output_mode": "prediction", "name": "pred_net_1", "error_activation": "relu", "return_state": false, "go_backwards": false, "trainable": true, "stack_sizes": [3, 48, 96, 192], "data_format": "channels_last", "stateful": false, "R_filt_sizes": [3, 3, 3, 3], "unroll": false, "R_stack_sizes": [3, 48, 96, 192], "extrap_start_time": 5, "implementation": 0, "A_activation": "relu", "Ahat_filt_sizes": [3, 3, 3, 3], "pixel_max": 1.0, "return_sequences": true, "LSTM_activation": "tanh"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "pred_net_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["pred_net_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}